; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.9.0
; Author:	gora <gora@7zsfx.info>
; Homepage:	http://www.gora.7zsfx.info
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=Файл
2=Опции
3=Помощь
4=Проверять сна&чала как SFX архив
; ------------------------------------
5=Выбор файла
6=&Архив/Инсталлятор, который нужно распаковать:
7=Выбор папки
8=&Папка для распаковки:
9=На эту вкладку файл можно перетаскивать
; ------------------------------------
10=Опции %s
11=Со&хранять историю
12=Скрывать окно &консоли
13=П&редлагать обновления:
14=&Язык:
15=Запо&мнить и не изменять размер окна
16=&Не закрывать окно после распаковки
; ------------------------------------
17=Специальные опции формата
18=Спрашивать перед &запуском файлов
19=&Удалять дубликаты файлов
20=Удалять &временные файлы
21=&Добавлять расширение к файлам
22=Удаля&ть файл после успешной распаковки
; ------------------------------------
23=О программе
; ------------------------------------
24=Сайт %s
25=Сайт официальной версии
26=Форум модифицированной версии
; ------------------------------------
27=Обновление
28=Последнее обновление было более %s дней назад!
29=Обновить программу сейчас?
30=Инте&грировать в оболочку
; ------------------------------------
31=&Извлечь
32=&Сохранить
33=О&бновить
34=&Отмена
35=Настройки
; ------------------------------------
36=Извлечение %s
37=%s поддерживает несколько методов извлечения %s.%nК сожалению, ни один из этих методов не надёжен на 100%.%nЕсли выбранный метод не работает, пожалуйста, запустите %s ещё раз и выберите другой метод.
; ------------------------------------
38=Метод извлечения
39=%s административная установка
40=%s извлечение
41=%s ключ
42=%s распаковщик
43=Это не инсталлятор InstallShield
44=Показ&ывать сводку после распаковки
; ------------------------------------
; GUI control functions
45=Откл&ючить звуки в программе
46=Версия 7-Zip
47=Не существует файла:%n%s%n%nПожалуйста, выберите существующий файл.
48=Открыть файл
49=Сохранить в
50=Все
; Common terms
51=архива
52=сжатого файла
53=Время: %s
54=электронной книги
55=электронной открытки
56=кодированного файла
57=неизвестного исполняемого файла
58=Неудачная инициализация
59=справки
60=хотфикса
61=образа
62=инсталлятора
63=модуля слияния
64=пакета
65=патча
66=SFX
67=этап
68=Инициализация произведена
69=Тестирование
70=Извлечение:
71=Размер архива
72=обновления
73=Имя архива
74=каждую неделю|каждые 2 недели|каждый месяц|никогда
; Status messages
75=Анализ типа файла
76=Анализ файла %s сканированием
77=Извлечение файлов из:
78=Ожидание запуска инсталлятора.%nПожалуйста, подождите
79=Для прерывания распаковки нажмите клавишу ESC%nСвернуть/развернуть окно можно, нажав клавишу F11
; Custom prompts
80=%s CD-ROM образы не могут быть извлечены напрямую.%nОбраз будет преобразован в ISO CD-ROM образ,%nкоторый и будет извлечен.%n%nПродолжить?%nПримечание: этот процесс может занять несколько минут!
81=Ошибка: CD-ROM образ не может быть преобразован.
82=Ошибка: ISO образ был создан из %s образа, но он не может быть распакован.%nХотите сохранить ISO образ для дальнейшего анализа?
83=Ошибка: возможно, это некорректный MHT файл.%nНикаких границ не было обнаружено.
84=%s. Выйдите из инсталлятора, затем нажмите 'OK', чтобы продолжить.
85=Внимание: этот метод работает только с определенными типами пакетов Wise Windows Installer.%nЕсли Wise Installation Wizard запустится и останется в режиме ожидания, значит этот файл не поддерживается.%nВ этом случае закройте инсталлятор и %s прервет извлечение.%n%nПродолжить извлечение?
86=Этот файл упакован с %s сжатием.%nМожно продолжить извлечение без %s распаковки%nили выполнить только %s распаковку.%n%nНажмите 'Да' для извлечения без %s распаковки.%n%nНажмите 'Нет' для выполнения только %s распаковки.%n%nВ последнем случае распакованный файл будет назван:%n%s
87=Ошибка: %s%nне может быть распакован.
88=Предостережение: для того, чтобы извлечь содержимое файлов такого типа, файл необходимо запустить.%nЕсли Вы продолжите, будет выполнена следующая команда:%n%n%s%n%nЕсли Вы предполагаете, что этому файлу не следует доверять (как malicious - 'злонамеренному'), не рекомендуется продолжать.%nХотите ли Вы продолжить извлечение?
89=Предостережение: папка назначения %s уже существует!%nИзвлечение в не пустую папку может привести к ошибке распаковки.%n%nОчистить папку перед распаковкой?
90=Для распаковки необходим пароль!%n%nОтключить опцию '%s'%nдля возможности ввода пароля?
91=Для распаковки данного архива необходим дополнительный%nраспаковщик %s
; Help text
92=Извлечение файлов из архива или инсталлятора любого типа.%nИспользование:%n%s%n%nПоддерживаемые параметры:%n%s%t%tПоказать эту справку%n%s%t%tОткрыть вкладку %s%n%s%tИмя файла, который нужно распаковать%n%s%tПуть\имя папки для распаковки%n%nУказание %s, вместо имени папки для распаковки, заставит %s извлекать в папку, названную по имени архива.%n%nПример:%s%n%nПри запуске %s без параметров будет показано основное окно программы в котором можно указать имя файла и папку для распаковки.
93=Извлечь с помощью %s
; Error messages
94=Извлечение %s невозможно записать в лог-файл.
95=архиватором 7-Zip
96=%s невозможно извлечь.%n%nТип файла определен как: %s%n%nНажмите 'OK', если хотите анализировать файл, или 'Отмена', чтобы выйти.
97=%s%nимеет неизвестное расширение и не может быть извлечён.
98=Невозможно создать папку:%n%s%nВыберите правильный путь.
99=%s не может быть извлечён.%nИзвлечение этого %s, возможно поддерживается, но оно неудачно.%nПодробности см. в лог-файле %s.%n%nНажмите 'OK', чтобы просмотреть лог-файл, или 'Отмена', чтобы выйти.
100=%t–= %s анализ =–
; Update messages
101=Обновление завершено
102=Началось обновление, ждите ...
103=Загрузка файлов
104=Загрузка завершена!
105=Обновлено до версии: %s
106=%n%s будет перезапущен!
107=У Вас установлена версия: %s%nОбновление не требуется!
; ------------------------------------
108=Ошибка загрузки
109=Не удалось загрузить файл-список с сервера.%nВозможно, отсутствует подключение к сети%nили недоступен сервер обновлений.
110=Ошибка загрузки файла
111=Ошибка распаковки файла
112=При обновлении до версии: %s%nпроизошли ошибки, повторите!!!
113=Выполнено: %s из %s
114=Информация
115=Версии распаковщиков
116=Открыть папку распаковки?
117=Строк в таблице
118=Разделитель
119=Открывать то&лько верхний уровень архива
120=Анализ PE-файлов
121=Не удалось обработать MSI файл
122=Из-за 'глубокого' расположения этого MSI пакета не удалось извлечь %s файла(ов).%nПодробности см. в %s.%n%nПереместите MSI пакет ближе к корню диска и повторите извлечение.%n%nНажмите 'OK', чтобы просмотреть лог-файл, или 'Отмена', чтобы выйти.
123=сигнатур -
124=Выбрать тип архива вручную (из списка) ?
125=Выберите сигнатуру предполагаемого типа архива
126=Попробуем для извлечения 'TotalObserver' ?